{"config": [{"config": {"batch_input_shape": [null, 1, 20], "name": "flatten_1", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_3", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"units": 1, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_4", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.9", "class_name": "Sequential"}