{"class_name": "Sequential", "keras_version": "2.0.9", "config": [{"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten_1", "batch_input_shape": [null, 1, 20], "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_constraint": null, "units": 24, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "kernel_constraint": null, "units": 24, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "kernel_constraint": null, "units": 24, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "kernel_constraint": null, "units": 1, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "linear", "trainable": true}}], "backend": "tensorflow"}