{"class_name": "Model", "keras_version": "2.0.9", "config": {"layers": [{"name": "observation_input", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "observation_input", "batch_input_shape": [null, 1, 20], "sparse": false}}, {"name": "action_input", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "action_input", "batch_input_shape": [null, 1], "sparse": false}}, {"name": "flatten_2", "inbound_nodes": [[["observation_input", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"name": "concatenate_1", "inbound_nodes": [[["action_input", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": -1, "trainable": true}}, {"name": "dense_5", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_5", "kernel_constraint": null, "units": 24, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"name": "activation_5", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"name": "dense_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_6", "kernel_constraint": null, "units": 24, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"name": "activation_6", "inbound_nodes": [[["dense_6", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"name": "dense_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_7", "kernel_constraint": null, "units": 24, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"name": "activation_7", "inbound_nodes": [[["dense_7", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"name": "dense_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_8", "kernel_constraint": null, "units": 1, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"name": "activation_8", "inbound_nodes": [[["dense_8", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_8", "activation": "linear", "trainable": true}}], "input_layers": [["action_input", 0, 0], ["observation_input", 0, 0]], "name": "model_1", "output_layers": [["activation_8", 0, 0]]}, "backend": "tensorflow"}