{"config": {"name": "model_1", "layers": [{"config": {"sparse": false, "name": "observation_input", "dtype": "float32", "batch_input_shape": [null, 1, 20]}, "inbound_nodes": [], "name": "observation_input", "class_name": "InputLayer"}, {"config": {"sparse": false, "name": "action_input", "dtype": "float32", "batch_input_shape": [null, 1]}, "inbound_nodes": [], "name": "action_input", "class_name": "InputLayer"}, {"config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["observation_input", 0, 0, {}]]], "name": "flatten_2", "class_name": "Flatten"}, {"config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["action_input", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate"}, {"config": {"units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_5", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense_5", "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "activation_5", "class_name": "Activation"}, {"config": {"units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_6", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "dense_6", "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_6", 0, 0, {}]]], "name": "activation_6", "class_name": "Activation"}, {"config": {"units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_7", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "dense_7", "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_7", 0, 0, {}]]], "name": "activation_7", "class_name": "Activation"}, {"config": {"units": 1, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_8", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "dense_8", "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "linear"}, "inbound_nodes": [[["dense_8", 0, 0, {}]]], "name": "activation_8", "class_name": "Activation"}], "output_layers": [["activation_8", 0, 0]], "input_layers": [["action_input", 0, 0], ["observation_input", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.9", "class_name": "Model"}