{"class_name": "Sequential", "keras_version": "2.0.9", "backend": "tensorflow", "config": [{"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "batch_input_shape": [null, 1, 4], "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_1", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_2", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_3", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_4", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "linear"}}]}