{"backend": "tensorflow", "keras_version": "2.0.9", "class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "batch_input_shape": [null, 1, 4], "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "units": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "units": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_3", "kernel_regularizer": null, "units": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_4", "kernel_regularizer": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_4"}}]}