{"keras_version": "2.0.9", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"batch_input_shape": [null, 1, 4], "name": "flatten_1", "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 16, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 16, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 16, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 2, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_4"}}]}