{"keras_version": "2.0.9", "config": [{"class_name": "Flatten", "config": {"name": "flatten_1", "dtype": "float32", "batch_input_shape": [null, 1, 7], "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 16, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 16, "name": "dense_2", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 16, "name": "dense_3", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 81, "name": "dense_4", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "linear", "trainable": true}}], "backend": "tensorflow", "class_name": "Sequential"}