{"keras_version": "2.0.9", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "dtype": "float32", "batch_input_shape": [null, 1, 7]}}, {"class_name": "Dense", "config": {"units": 16, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 16, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 16, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 81, "name": "dense_4", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "linear"}}]}