{"keras_version": "2.0.9", "backend": "tensorflow", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 1, 7], "name": "flatten_1", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 24, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 24, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 24, "trainable": true, "kernel_regularizer": null, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 81, "trainable": true, "kernel_regularizer": null, "name": "dense_4", "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_4"}, "class_name": "Activation"}], "class_name": "Sequential"}