{"backend": "tensorflow", "keras_version": "2.0.9", "config": [{"config": {"dtype": "float32", "name": "flatten_1", "batch_input_shape": [null, 1, 20], "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_3", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"units": 1, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_4", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}