{"backend": "tensorflow", "keras_version": "2.0.9", "config": {"input_layers": [["action_input", 0, 0], ["observation_input", 0, 0]], "output_layers": [["activation_8", 0, 0]], "name": "model_1", "layers": [{"name": "observation_input", "config": {"dtype": "float32", "sparse": false, "name": "observation_input", "batch_input_shape": [null, 1, 20]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "action_input", "config": {"dtype": "float32", "sparse": false, "name": "action_input", "batch_input_shape": [null, 1]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "flatten_2", "config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["observation_input", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "class_name": "Concatenate", "inbound_nodes": [[["action_input", 0, 0, {}], ["flatten_2", 0, 0, {}]]]}, {"name": "dense_5", "config": {"units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_5", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "activation_5", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"name": "dense_6", "config": {"units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_6", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "activation_6", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"name": "dense_7", "config": {"units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_7", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "activation_7", "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"name": "dense_8", "config": {"units": 1, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_8", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "activation_8", "config": {"name": "activation_8", "activation": "linear", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["dense_8", 0, 0, {}]]]}]}, "class_name": "Model"}