{"config": [{"config": {"batch_input_shape": [null, 1, 5], "name": "flatten_1", "trainable": true, "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "kernel_regularizer": null, "trainable": true, "units": 24, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "kernel_regularizer": null, "trainable": true, "units": 24, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "kernel_regularizer": null, "trainable": true, "units": 24, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "name": "dense_3", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "kernel_regularizer": null, "trainable": true, "units": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "name": "dense_4", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_4", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.9"}