{"config": [{"config": {"name": "flatten_1", "dtype": "float32", "trainable": true, "batch_input_shape": [null, 1, 5]}, "class_name": "Flatten"}, {"config": {"activation": "linear", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "units": 24, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "units": 24, "use_bias": true, "name": "dense_2", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "units": 24, "use_bias": true, "name": "dense_3", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "units": 3, "use_bias": true, "name": "dense_4", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.9", "backend": "tensorflow", "class_name": "Sequential"}