{"config": [{"class_name": "Flatten", "config": {"batch_input_shape": [null, 1, 4], "name": "flatten_1", "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 24, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 24, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 24, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_4", "trainable": true}}], "keras_version": "2.0.9", "class_name": "Sequential", "backend": "tensorflow"}