{"config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1, 4], "name": "observation_input", "dtype": "float32", "sparse": false}, "name": "observation_input"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1], "name": "action_input", "dtype": "float32", "sparse": false}, "name": "action_input"}, {"class_name": "Flatten", "inbound_nodes": [[["observation_input", 0, 0, {}]]], "config": {"name": "flatten_2", "trainable": true}, "name": "flatten_2"}, {"class_name": "Concatenate", "inbound_nodes": [[["action_input", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "name": "concatenate_1"}, {"class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"activation": "linear", "units": 24, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true}, "name": "dense_5"}, {"class_name": "Activation", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "name": "activation_5"}, {"class_name": "Dense", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"activation": "linear", "units": 24, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true}, "name": "dense_6"}, {"class_name": "Activation", "inbound_nodes": [[["dense_6", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "name": "activation_6"}, {"class_name": "Dense", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"activation": "linear", "units": 24, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_7", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true}, "name": "dense_7"}, {"class_name": "Activation", "inbound_nodes": [[["dense_7", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "name": "activation_7"}, {"class_name": "Dense", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"activation": "linear", "units": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_8", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true}, "name": "dense_8"}, {"class_name": "Activation", "inbound_nodes": [[["dense_8", 0, 0, {}]]], "config": {"activation": "linear", "name": "activation_8", "trainable": true}, "name": "activation_8"}], "name": "model_1", "output_layers": [["activation_8", 0, 0]], "input_layers": [["action_input", 0, 0], ["observation_input", 0, 0]]}, "keras_version": "2.0.9", "class_name": "Model", "backend": "tensorflow"}