{"backend": "tensorflow", "keras_version": "2.0.9", "class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "batch_input_shape": [null, 1, 7], "dtype": "float32"}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "units": 24, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "units": 24, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "units": 24, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "units": 2, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "linear"}}]}