{"backend": "tensorflow", "keras_version": "2.0.9", "class_name": "Model", "config": {"input_layers": [["action_input", 0, 0], ["observation_input", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "observation_input", "config": {"sparse": false, "name": "observation_input", "batch_input_shape": [null, 1, 7], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "action_input", "config": {"sparse": false, "name": "action_input", "batch_input_shape": [null, 2], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Flatten", "name": "flatten_2", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["observation_input", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["action_input", 0, 0, {}], ["flatten_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "units": 24, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_6", "config": {"name": "dense_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "units": 24, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_7", "config": {"name": "dense_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "units": 24, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_8", "config": {"name": "dense_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "units": 1, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"trainable": true, "name": "activation_8", "activation": "linear"}, "inbound_nodes": [[["dense_8", 0, 0, {}]]]}], "output_layers": [["activation_8", 0, 0]]}}